src/InformationRegisters/ТекущиеЗначенияПроизводительности/ТекущиеЗначенияПроизводительности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ТекущиеЗначенияПроизводительности</name>
  <resources>
    <name>Значение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ДатаЗамера</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеОшибки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>Сервер</name>
    <type>
      <types>CatalogRef.Оборудование</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СчетчикПроизводительности</name>
    <type>
      <types>CatalogRef.СчетчикиПроизводительности</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ТекущиеЗначенияПроизводительности/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
    
#Область ПрограммныйИнтерфейс

Функция ПолучитьЗначения(Оборудование) Экспорт
    
    Запрос = Новый Запрос;
    
    Запрос.Текст = "
    |ВЫБРАТЬ
    |   СчетчикПроизводительности,
    |   Значение,
    |   ОписаниеОшибки
    |ИЗ
    |   РегистрСведений.ТекущиеЗначенияПроизводительности КАК РегСвТекЗнач
    |ГДЕ
    |   Сервер = &Оборудование
    |";
    
    Запрос.УстановитьПараметр("Оборудование", Оборудование);
    
    Результат = Запрос.Выполнить();
    
    СчетчикиЗначения = Новый Соответствие;
    
    Выборка = Результат.Выбрать();
    Пока Выборка.Следующий() Цикл
        
        СчетчикиЗначения.Вставить(Выборка.СчетчикПроизводительности, Новый Структура("Значение, ОписаниеОшибки", Выборка.Значение, Выборка.ОписаниеОшибки));
        
    КонецЦикла;
    
    Возврат СчетчикиЗначения;        
    
КонецФункции

Процедура Очистить(Оборудование) Экспорт
    
    Запрос = Новый Запрос;
    
    Запрос.Текст = "
    |ВЫБРАТЬ ПЕРВЫЕ 1
    |   Сервер
    |ИЗ
    |   РегистрСведений.ТекущиеЗначенияПроизводительности КАК РегСвТекЗнач
    |ГДЕ
    |   Сервер = &Оборудование
    |";
    
    Запрос.УстановитьПараметр("Оборудование", Оборудование);
    
    Результат = Запрос.Выполнить();
    
    Если НЕ Результат.Пустой() Тогда
        НаборЗаписей = СоздатьНаборЗаписей();
        НаборЗаписей.Отбор.Сервер.Установить(Оборудование);
        НаборЗаписей.Записать(Истина);
    КонецЕсли;
        
КонецПроцедуры

#КонецОбласти

#КонецЕсли
